; domain
(define (domain driverlog)
  (:requirements :typing :fluents)
  (:types
    location locatable - object
    driver truck obj - locatable
  )

  (:predicates
    (at ?obj - locatable ?loc - location)
    (in ?obj1 - obj ?obj - truck)
    (driving ?d - driver ?v - truck)
    (link ?x - location ?y - location)
    (path ?x - location ?y - location)
    (empty ?v - truck)
  )
  (:functions
    (time-to-walk ?l1 - location ?l2 - location)
    (time-to-drive ?l1 - location ?l2 - location)
    (driven)
    (walked)
  )

  (:action LOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and
      (at ?truck ?loc)
      (at ?obj ?loc))
    :effect (and (not (at ?obj ?loc)) (in ?obj ?truck))
  )

  (:action UNLOAD-TRUCK
    :parameters (?obj - obj ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (in ?obj ?truck))
    :effect (and (not (in ?obj ?truck)) (at ?obj ?loc))
  )

  (:action BOARD-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (at ?driver ?loc) (empty ?truck))
    :effect (and (not (at ?driver ?loc)) (driving ?driver ?truck) (not (empty ?truck)))
  )

  (:action DISEMBARK-TRUCK
    :parameters (?driver - driver ?truck - truck ?loc - location)
    :precondition (and (at ?truck ?loc) (driving ?driver ?truck))
    :effect (and (not (driving ?driver ?truck)) (at ?driver ?loc) (empty ?truck))
  )

  (:action DRIVE-TRUCK
    :parameters (?truck - truck ?loc-from - location ?loc-to - location ?driver - driver)
    :precondition (and (at ?truck ?loc-from)
      (driving ?driver ?truck) (link ?loc-from ?loc-to))
    :effect (and (not (at ?truck ?loc-from)) (at ?truck ?loc-to)
      (increase
        (driven)
        (time-to-drive ?loc-from ?loc-to)))
  )

  (:action WALK
    :parameters (?driver - driver ?loc-from - location ?loc-to - location)
    :precondition (and (at ?driver ?loc-from) (path ?loc-from ?loc-to))
    :effect (and (not (at ?driver ?loc-from)) (at ?driver ?loc-to)
      (increase
        (walked)
        (time-to-walk ?loc-from ?loc-to)))
  )

)

; problem
(define (problem DLOG-5-3-8)
	(:domain driverlog)
	(:objects
	driver1 - driver
	driver2 - driver
	driver3 - driver
	driver4 - driver
	driver5 - driver
	truck1 - truck
	truck2 - truck
	truck3 - truck
	package1 - obj
	package2 - obj
	package3 - obj
	package4 - obj
	package5 - obj
	package6 - obj
	package7 - obj
	package8 - obj
	s0 - location
	s1 - location
	s2 - location
	s3 - location
	s4 - location
	s5 - location
	s6 - location
	s7 - location
	s8 - location
	s9 - location
	s10 - location
	p0-1 - location
	p1-2 - location
	p2-3 - location
	p2-5 - location
	p2-6 - location
	p2-7 - location
	p3-5 - location
	p3-10 - location
	p4-7 - location
	p4-9 - location
	p5-0 - location
	p5-4 - location
	p5-8 - location
	p6-7 - location
	p6-8 - location
	p6-9 - location
	p7-8 - location
	p8-9 - location
	p9-0 - location
	p10-1 - location
	p10-3 - location
	)
	(:init
	(at driver1 s8)
	(at driver2 s1)
	(at driver3 s1)
	(at driver4 s6)
	(at driver5 s7)
	(at truck1 s3)
	(empty truck1)
	(at truck2 s2)
	(empty truck2)
	(at truck3 s9)
	(empty truck3)
	(at package1 s7)
	(at package2 s3)
	(at package3 s4)
	(at package4 s5)
	(at package5 s0)
	(at package6 s4)
	(at package7 s9)
	(at package8 s9)
	(path s0 p0-1)
	(path p0-1 s0)
	(path s1 p0-1)
	(path p0-1 s1)
	(= (time-to-walk s0 p0-1) 92)
	(= (time-to-walk p0-1 s0) 92)
	(= (time-to-walk s1 p0-1) 26)
	(= (time-to-walk p0-1 s1) 26)
	(path s1 p1-2)
	(path p1-2 s1)
	(path s2 p1-2)
	(path p1-2 s2)
	(= (time-to-walk s1 p1-2) 3)
	(= (time-to-walk p1-2 s1) 3)
	(= (time-to-walk s2 p1-2) 49)
	(= (time-to-walk p1-2 s2) 49)
	(path s2 p2-3)
	(path p2-3 s2)
	(path s3 p2-3)
	(path p2-3 s3)
	(= (time-to-walk s2 p2-3) 10)
	(= (time-to-walk p2-3 s2) 10)
	(= (time-to-walk s3 p2-3) 90)
	(= (time-to-walk p2-3 s3) 90)
	(path s2 p2-5)
	(path p2-5 s2)
	(path s5 p2-5)
	(path p2-5 s5)
	(= (time-to-walk s2 p2-5) 80)
	(= (time-to-walk p2-5 s2) 80)
	(= (time-to-walk s5 p2-5) 77)
	(= (time-to-walk p2-5 s5) 77)
	(path s2 p2-6)
	(path p2-6 s2)
	(path s6 p2-6)
	(path p2-6 s6)
	(= (time-to-walk s2 p2-6) 65)
	(= (time-to-walk p2-6 s2) 65)
	(= (time-to-walk s6 p2-6) 47)
	(= (time-to-walk p2-6 s6) 47)
	(path s2 p2-7)
	(path p2-7 s2)
	(path s7 p2-7)
	(path p2-7 s7)
	(= (time-to-walk s2 p2-7) 6)
	(= (time-to-walk p2-7 s2) 6)
	(= (time-to-walk s7 p2-7) 3)
	(= (time-to-walk p2-7 s7) 3)
	(path s3 p3-5)
	(path p3-5 s3)
	(path s5 p3-5)
	(path p3-5 s5)
	(= (time-to-walk s3 p3-5) 3)
	(= (time-to-walk p3-5 s3) 3)
	(= (time-to-walk s5 p3-5) 46)
	(= (time-to-walk p3-5 s5) 46)
	(path s3 p3-10)
	(path p3-10 s3)
	(path s10 p3-10)
	(path p3-10 s10)
	(= (time-to-walk s3 p3-10) 16)
	(= (time-to-walk p3-10 s3) 16)
	(= (time-to-walk s10 p3-10) 66)
	(= (time-to-walk p3-10 s10) 66)
	(path s4 p4-7)
	(path p4-7 s4)
	(path s7 p4-7)
	(path p4-7 s7)
	(= (time-to-walk s4 p4-7) 93)
	(= (time-to-walk p4-7 s4) 93)
	(= (time-to-walk s7 p4-7) 40)
	(= (time-to-walk p4-7 s7) 40)
	(path s4 p4-9)
	(path p4-9 s4)
	(path s9 p4-9)
	(path p4-9 s9)
	(= (time-to-walk s4 p4-9) 89)
	(= (time-to-walk p4-9 s4) 89)
	(= (time-to-walk s9 p4-9) 97)
	(= (time-to-walk p4-9 s9) 97)
	(path s5 p5-0)
	(path p5-0 s5)
	(path s0 p5-0)
	(path p5-0 s0)
	(= (time-to-walk s5 p5-0) 80)
	(= (time-to-walk p5-0 s5) 80)
	(= (time-to-walk s0 p5-0) 19)
	(= (time-to-walk p5-0 s0) 19)
	(path s5 p5-4)
	(path p5-4 s5)
	(path s4 p5-4)
	(path p5-4 s4)
	(= (time-to-walk s5 p5-4) 38)
	(= (time-to-walk p5-4 s5) 38)
	(= (time-to-walk s4 p5-4) 79)
	(= (time-to-walk p5-4 s4) 79)
	(path s5 p5-8)
	(path p5-8 s5)
	(path s8 p5-8)
	(path p5-8 s8)
	(= (time-to-walk s5 p5-8) 92)
	(= (time-to-walk p5-8 s5) 92)
	(= (time-to-walk s8 p5-8) 20)
	(= (time-to-walk p5-8 s8) 20)
	(path s6 p6-7)
	(path p6-7 s6)
	(path s7 p6-7)
	(path p6-7 s7)
	(= (time-to-walk s6 p6-7) 50)
	(= (time-to-walk p6-7 s6) 50)
	(= (time-to-walk s7 p6-7) 12)
	(= (time-to-walk p6-7 s7) 12)
	(path s6 p6-8)
	(path p6-8 s6)
	(path s8 p6-8)
	(path p6-8 s8)
	(= (time-to-walk s6 p6-8) 2)
	(= (time-to-walk p6-8 s6) 2)
	(= (time-to-walk s8 p6-8) 50)
	(= (time-to-walk p6-8 s8) 50)
	(path s6 p6-9)
	(path p6-9 s6)
	(path s9 p6-9)
	(path p6-9 s9)
	(= (time-to-walk s6 p6-9) 58)
	(= (time-to-walk p6-9 s6) 58)
	(= (time-to-walk s9 p6-9) 93)
	(= (time-to-walk p6-9 s9) 93)
	(path s7 p7-8)
	(path p7-8 s7)
	(path s8 p7-8)
	(path p7-8 s8)
	(= (time-to-walk s7 p7-8) 75)
	(= (time-to-walk p7-8 s7) 75)
	(= (time-to-walk s8 p7-8) 61)
	(= (time-to-walk p7-8 s8) 61)
	(path s8 p8-9)
	(path p8-9 s8)
	(path s9 p8-9)
	(path p8-9 s9)
	(= (time-to-walk s8 p8-9) 41)
	(= (time-to-walk p8-9 s8) 41)
	(= (time-to-walk s9 p8-9) 84)
	(= (time-to-walk p8-9 s9) 84)
	(path s9 p9-0)
	(path p9-0 s9)
	(path s0 p9-0)
	(path p9-0 s0)
	(= (time-to-walk s9 p9-0) 51)
	(= (time-to-walk p9-0 s9) 51)
	(= (time-to-walk s0 p9-0) 21)
	(= (time-to-walk p9-0 s0) 21)
	(path s10 p10-1)
	(path p10-1 s10)
	(path s1 p10-1)
	(path p10-1 s1)
	(= (time-to-walk s10 p10-1) 60)
	(= (time-to-walk p10-1 s10) 60)
	(= (time-to-walk s1 p10-1) 15)
	(= (time-to-walk p10-1 s1) 15)
	(link s0 s1)
	(link s1 s0)
	(= (time-to-drive s0 s1) 68)
	(= (time-to-drive s1 s0) 68)
	(link s0 s3)
	(link s3 s0)
	(= (time-to-drive s0 s3) 66)
	(= (time-to-drive s3 s0) 66)
	(link s0 s6)
	(link s6 s0)
	(= (time-to-drive s0 s6) 17)
	(= (time-to-drive s6 s0) 17)
	(link s2 s1)
	(link s1 s2)
	(= (time-to-drive s2 s1) 70)
	(= (time-to-drive s1 s2) 70)
	(link s2 s3)
	(link s3 s2)
	(= (time-to-drive s2 s3) 11)
	(= (time-to-drive s3 s2) 11)
	(link s2 s10)
	(link s10 s2)
	(= (time-to-drive s2 s10) 33)
	(= (time-to-drive s10 s2) 33)
	(link s3 s7)
	(link s7 s3)
	(= (time-to-drive s3 s7) 36)
	(= (time-to-drive s7 s3) 36)
	(link s4 s3)
	(link s3 s4)
	(= (time-to-drive s4 s3) 4)
	(= (time-to-drive s3 s4) 4)
	(link s4 s5)
	(link s5 s4)
	(= (time-to-drive s4 s5) 72)
	(= (time-to-drive s5 s4) 72)
	(link s4 s6)
	(link s6 s4)
	(= (time-to-drive s4 s6) 24)
	(= (time-to-drive s6 s4) 24)
	(link s4 s7)
	(link s7 s4)
	(= (time-to-drive s4 s7) 100)
	(= (time-to-drive s7 s4) 100)
	(link s5 s0)
	(link s0 s5)
	(= (time-to-drive s5 s0) 52)
	(= (time-to-drive s0 s5) 52)
	(link s5 s1)
	(link s1 s5)
	(= (time-to-drive s5 s1) 43)
	(= (time-to-drive s1 s5) 43)
	(link s5 s2)
	(link s2 s5)
	(= (time-to-drive s5 s2) 37)
	(= (time-to-drive s2 s5) 37)
	(link s5 s3)
	(link s3 s5)
	(= (time-to-drive s5 s3) 31)
	(= (time-to-drive s3 s5) 31)
	(link s6 s3)
	(link s3 s6)
	(= (time-to-drive s6 s3) 34)
	(= (time-to-drive s3 s6) 34)
	(link s6 s8)
	(link s8 s6)
	(= (time-to-drive s6 s8) 57)
	(= (time-to-drive s8 s6) 57)
	(link s7 s0)
	(link s0 s7)
	(= (time-to-drive s7 s0) 81)
	(= (time-to-drive s0 s7) 81)
	(link s7 s1)
	(link s1 s7)
	(= (time-to-drive s7 s1) 46)
	(= (time-to-drive s1 s7) 46)
	(link s7 s8)
	(link s8 s7)
	(= (time-to-drive s7 s8) 58)
	(= (time-to-drive s8 s7) 58)
	(link s8 s0)
	(link s0 s8)
	(= (time-to-drive s8 s0) 30)
	(= (time-to-drive s0 s8) 30)
	(link s8 s3)
	(link s3 s8)
	(= (time-to-drive s8 s3) 4)
	(= (time-to-drive s3 s8) 4)
	(link s8 s5)
	(link s5 s8)
	(= (time-to-drive s8 s5) 50)
	(= (time-to-drive s5 s8) 50)
	(link s8 s9)
	(link s9 s8)
	(= (time-to-drive s8 s9) 4)
	(= (time-to-drive s9 s8) 4)
	(link s8 s10)
	(link s10 s8)
	(= (time-to-drive s8 s10) 64)
	(= (time-to-drive s10 s8) 64)
	(link s9 s2)
	(link s2 s9)
	(= (time-to-drive s9 s2) 91)
	(= (time-to-drive s2 s9) 91)
	(link s9 s3)
	(link s3 s9)
	(= (time-to-drive s9 s3) 87)
	(= (time-to-drive s3 s9) 87)
	(link s9 s7)
	(link s7 s9)
	(= (time-to-drive s9 s7) 14)
	(= (time-to-drive s7 s9) 14)
	(link s10 s4)
	(link s4 s10)
	(= (time-to-drive s10 s4) 12)
	(= (time-to-drive s4 s10) 12)
	(link s10 s7)
	(link s7 s10)
	(= (time-to-drive s10 s7) 47)
	(= (time-to-drive s7 s10) 47)
	(= (driven) 0)
	(= (walked) 0)
)
	(:goal (and
	(at driver2 s6)
	(at driver3 s0)
	(at driver4 s4)
	(at driver5 s5)
	(at truck2 s6)
	(at truck3 s9)
	(at package1 s8)
	(at package2 s4)
	(at package3 s1)
	(at package4 s2)
	(at package5 s4)
	(at package6 s10)
	(at package7 s7)
	(at package8 s10)
	))

(:metric minimize (+ (+ (* 2  (total-time)) (* 4  (driven))) (* 1  (walked))))

)

; plan
1. (walk driver2 s1 p1-2)
   deleted: (at driver2 s1)
   added: (at driver2 p1-2)
   changed: (walked) from 0 to 3
   goals met: 1 of 14
2. (walk driver2 p1-2 s2)
   deleted: (at driver2 p1-2)
   added: (at driver2 s2)
   changed: (walked) from 3 to 52
   goals met: 1 of 14
3. (board-truck driver2 truck2 s2)
   deleted: (at driver2 s2) (empty truck2)
   added: (driving driver2 truck2)
   goals met: 1 of 14
4. (drive-truck truck2 s2 s3 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (driven) from 0 to 11
   goals met: 1 of 14
5. (walk driver3 s1 p0-1)
   deleted: (at driver3 s1)
   added: (at driver3 p0-1)
   changed: (walked) from 52 to 78
   goals met: 1 of 14
6. (walk driver3 p0-1 s0)
   deleted: (at driver3 p0-1)
   added: (at driver3 s0)
   changed: (walked) from 78 to 170
   goals met: 2 of 14
7. (load-truck package2 truck2 s3)
   deleted: (at package2 s3)
   added: (in package2 truck2)
   goals met: 2 of 14
8. (drive-truck truck2 s3 s4 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   changed: (driven) from 11 to 15
   goals met: 2 of 14
9. (unload-truck package2 truck2 s4)
   deleted: (in package2 truck2)
   added: (at package2 s4)
   goals met: 3 of 14
10. (load-truck package3 truck2 s4)
   deleted: (at package3 s4)
   added: (in package3 truck2)
   goals met: 3 of 14
11. (load-truck package6 truck2 s4)
   deleted: (at package6 s4)
   added: (in package6 truck2)
   goals met: 3 of 14
12. (drive-truck truck2 s4 s3 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s3)
   changed: (driven) from 15 to 19
   goals met: 3 of 14
13. (drive-truck truck2 s3 s0 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s0)
   changed: (driven) from 19 to 85
   goals met: 3 of 14
14. (load-truck package5 truck2 s0)
   deleted: (at package5 s0)
   added: (in package5 truck2)
   goals met: 3 of 14
15. (drive-truck truck2 s0 s3 driver2)
   deleted: (at truck2 s0)
   added: (at truck2 s3)
   changed: (driven) from 85 to 151
   goals met: 3 of 14
16. (drive-truck truck2 s3 s4 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s4)
   changed: (driven) from 151 to 155
   goals met: 3 of 14
17. (unload-truck package5 truck2 s4)
   deleted: (in package5 truck2)
   added: (at package5 s4)
   goals met: 4 of 14
18. (drive-truck truck2 s4 s10 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s10)
   changed: (driven) from 155 to 167
   goals met: 4 of 14
19. (unload-truck package6 truck2 s10)
   deleted: (in package6 truck2)
   added: (at package6 s10)
   goals met: 5 of 14
20. (walk driver4 s6 p6-9)
   deleted: (at driver4 s6)
   added: (at driver4 p6-9)
   changed: (walked) from 170 to 228
   goals met: 5 of 14
21. (drive-truck truck2 s10 s7 driver2)
   deleted: (at truck2 s10)
   added: (at truck2 s7)
   changed: (driven) from 167 to 214
   goals met: 5 of 14
22. (load-truck package1 truck2 s7)
   deleted: (at package1 s7)
   added: (in package1 truck2)
   goals met: 5 of 14
23. (walk driver4 p6-9 s9)
   deleted: (at driver4 p6-9)
   added: (at driver4 s9)
   changed: (walked) from 228 to 321
   goals met: 5 of 14
24. (walk driver4 s9 p4-9)
   deleted: (at driver4 s9)
   added: (at driver4 p4-9)
   changed: (walked) from 321 to 418
   goals met: 5 of 14
25. (walk driver4 p4-9 s4)
   deleted: (at driver4 p4-9)
   added: (at driver4 s4)
   changed: (walked) from 418 to 507
   goals met: 6 of 14
26. (drive-truck truck2 s7 s8 driver2)
   deleted: (at truck2 s7)
   added: (at truck2 s8)
   changed: (driven) from 214 to 272
   goals met: 6 of 14
27. (unload-truck package1 truck2 s8)
   deleted: (in package1 truck2)
   added: (at package1 s8)
   goals met: 7 of 14
28. (drive-truck truck2 s8 s9 driver2)
   deleted: (at truck2 s8)
   added: (at truck2 s9)
   changed: (driven) from 272 to 276
   goals met: 7 of 14
29. (load-truck package7 truck2 s9)
   deleted: (at package7 s9)
   added: (in package7 truck2)
   goals met: 7 of 14
30. (load-truck package8 truck2 s9)
   deleted: (at package8 s9)
   added: (in package8 truck2)
   goals met: 7 of 14
31. (drive-truck truck2 s9 s8 driver2)
   deleted: (at truck2 s9)
   added: (at truck2 s8)
   changed: (driven) from 276 to 280
   goals met: 7 of 14
32. (drive-truck truck2 s8 s10 driver2)
   deleted: (at truck2 s8)
   added: (at truck2 s10)
   changed: (driven) from 280 to 344
   goals met: 7 of 14
33. (unload-truck package8 truck2 s10)
   deleted: (in package8 truck2)
   added: (at package8 s10)
   goals met: 8 of 14
34. (drive-truck truck2 s10 s8 driver2)
   deleted: (at truck2 s10)
   added: (at truck2 s8)
   changed: (driven) from 344 to 408
   goals met: 8 of 14
35. (drive-truck truck2 s8 s5 driver2)
   deleted: (at truck2 s8)
   added: (at truck2 s5)
   changed: (driven) from 408 to 458
   goals met: 8 of 14
36. (drive-truck truck2 s5 s1 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s1)
   changed: (driven) from 458 to 501
   goals met: 8 of 14
37. (unload-truck package3 truck2 s1)
   deleted: (in package3 truck2)
   added: (at package3 s1)
   goals met: 9 of 14
38. (drive-truck truck2 s1 s5 driver2)
   deleted: (at truck2 s1)
   added: (at truck2 s5)
   changed: (driven) from 501 to 544
   goals met: 9 of 14
39. (load-truck package4 truck2 s5)
   deleted: (at package4 s5)
   added: (in package4 truck2)
   goals met: 9 of 14
40. (walk driver5 s7 p2-7)
   deleted: (at driver5 s7)
   added: (at driver5 p2-7)
   changed: (walked) from 507 to 510
   goals met: 9 of 14
41. (walk driver5 p2-7 s2)
   deleted: (at driver5 p2-7)
   added: (at driver5 s2)
   changed: (walked) from 510 to 516
   goals met: 9 of 14
42. (walk driver5 s2 p2-5)
   deleted: (at driver5 s2)
   added: (at driver5 p2-5)
   changed: (walked) from 516 to 596
   goals met: 9 of 14
43. (walk driver5 p2-5 s5)
   deleted: (at driver5 p2-5)
   added: (at driver5 s5)
   changed: (walked) from 596 to 673
   goals met: 10 of 14
44. (drive-truck truck2 s5 s2 driver2)
   deleted: (at truck2 s5)
   added: (at truck2 s2)
   changed: (driven) from 544 to 581
   goals met: 10 of 14
45. (unload-truck package4 truck2 s2)
   deleted: (in package4 truck2)
   added: (at package4 s2)
   goals met: 11 of 14
46. (drive-truck truck2 s2 s3 driver2)
   deleted: (at truck2 s2)
   added: (at truck2 s3)
   changed: (driven) from 581 to 592
   goals met: 11 of 14
47. (drive-truck truck2 s3 s7 driver2)
   deleted: (at truck2 s3)
   added: (at truck2 s7)
   changed: (driven) from 592 to 628
   goals met: 11 of 14
48. (unload-truck package7 truck2 s7)
   deleted: (in package7 truck2)
   added: (at package7 s7)
   goals met: 12 of 14
49. (drive-truck truck2 s7 s4 driver2)
   deleted: (at truck2 s7)
   added: (at truck2 s4)
   changed: (driven) from 628 to 728
   goals met: 12 of 14
50. (drive-truck truck2 s4 s6 driver2)
   deleted: (at truck2 s4)
   added: (at truck2 s6)
   changed: (driven) from 728 to 752
   goals met: 13 of 14
51. (disembark-truck driver2 truck2 s6)
   deleted: (driving driver2 truck2)
   added: (at driver2 s6) (empty truck2)
   goals met: 14 of 14
